app/admin/employees.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    column :contact
    column :address
    column :department_id do |obj|
         Department.find(obj.department_id).department_name

SELECT "departments".* FROM "departments" WHERE "departments"."department_name" != ?  [["department_name", "admin"]]
---
      f.input :password
      f.input :contact
      f.input :address
      f.input :department, as: :select, collection: Department.where.not(department_name: 'admin').map{ |a| [a.department_name, a.id] }