app/admin/reports.rb

  scope :all, default: true

  permit_params :name, :department_id

  index do
    selectable_column
    id_column
    column :name
    column :department_id do |obj|
      Department.find(obj.department_id).department_name
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]