app/admin/salaries.rb

SELECT "departments".* FROM "departments" WHERE "departments"."department_name" != ?  [["department_name", "admin"]]
---
      f.input :name
      f.input :email
      f.input :salary
      f.input :department, as: :select, collection: Department.where.not(department_name: 'admin').map{ |a| [a.department_name, a.id] }